app/controllers/books_controller.rb

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "opinion12"], ["updated_at", "2021-11-05 07:38:41.981083"], ["id", 15]]